# ViewGraphSchedRowsFrom Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ViewGraphSchedRowsFrom Property
ParameterTypeId Class See Also
---
"Segment Start in Viewport"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ViewGraphSchedRowsFrom { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ViewGraphSchedRowsFrom As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ViewGraphSchedRowsFrom {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace